<?php
/**
 * -------------------------------------------------------------------
 * 주 경로 상수를 설정, 디렉토리 구분자 설정
 * -------------------------------------------------------------------
 */
define ( 'ROOT_PATH', dirname ( __FILE__ ) );
define ( 'BASE_PATH', dirname ( ROOT_PATH ) );
// http://localhost/media/public/_template/assets/vendor/jquery/jquery-1.12.0.min.js?v313
/**
 * ---------------------------------------------------------------
 * ini_set('date.timezone', 'Asia/Seoul'); //한국시간(timezone)설정
 * ---------------------------------------------------------------
 */
date_default_timezone_set ( 'Asia/Seoul' ); // 한국시간(timezone)설정

/**
 * -------------------------------------------------------------------
 * ClassLoader implements a PSR-0, PSR-4 and classmap class loader.
 * -------------------------------------------------------------------
 */
$loader = require_once BASE_PATH . '/vendor/autoload.php';

/**
 * -------------------------------------------------------------------
 * Set up dependencies
 * -------------------------------------------------------------------
 */
require_once BASE_PATH . '/app/dependencies.php';

/**
 * -------------------------------------------------------------------
 * Instantiate the app
 * -------------------------------------------------------------------
 */
$app = new Kaiser\App ( $container, BASE_PATH );

$app->setAppDir ( [ 
		__DIR__ . '/../app' 
] );

/**
 * -------------------------------------------------------------------
 * Run app
 * -------------------------------------------------------------------
 */
$app->run ();